{
    "intents": [
      {
        "tag": "greetings",
        "patterns": [
          "Hello",
          "Hi",
          "Hey",
          "Good morning",
          "Good afternoon",
          "Good evening"
        ],
        "responses": [
          "Hello! How can I assist you today?",
          "Hi! What would you like to know?",
          "Hey there! How can I help?",
          "Good day! What can I do for you?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Bye",
          "Goodbye",
          "See you later",
          "Take care"
        ],
        "responses": [
          "Goodbye! Feel free to reach out anytime.",
          "Take care! Let me know if you need anything else.",
          "See you later! Have a great day."
        ]
      },
      {
        "tag": "thank_you",
        "patterns": [
          "Thank you",
          "Thanks",
          "I appreciate it",
          "Thanks a lot"
        ],
        "responses": [
          "You're welcome!",
          "Glad I could help!",
          "No problem, happy to assist!"
        ]
      },
      {
        "tag": "about_app",
        "patterns": [
          "What is the HDIMS app?",
          "Tell me about the HDIMS app.",
          "What does the Health Data Information & Management System do?",
          "What is the purpose of the HDIMS app?",
          "How does the HDIMS app work?"
        ],
        "responses": [
          "The Health Data Information & Management System (HDIMS) Mobile Application allows hospitals and departments to enter and update healthcare data dynamically. The data can be accessed by Super Admins to implement health and family welfare schemes, monitor performance, and provide policy inputs. The app ensures smooth data flow from facility to sub-district, district, and state levels, improving efficiency and decision-making in healthcare."
        ]
      },
      
      
      {
        "tag": "welfare_schemes",
        "patterns": [
          "What welfare schemes are supported by HDIMS?",
          "How does HDIMS help with welfare schemes?",
          "What welfare programs can be managed through HDIMS?",
          "Explain welfare schemes in HDIMS.",
          "How does HDIMS assist in implementing welfare schemes?",
          "Tell me some medical welfare schemes managed by HDIMS."
        ],
        "responses": [
          "HDIMS helps manage various health and family welfare schemes such as the **National Health Mission (NHM)**, **Ayushman Bharat (PM-JAY)**, **Rashtriya Bal Swasthya Karyakram (RBSK)**, and the **Pradhan Mantri Surakshit Matritva Abhiyan (PMSMA)**. The app allows hospitals and departments to update relevant data in real time, which can be accessed by Super Admins to monitor the performance of these schemes. It also aids in ensuring that healthcare services are effectively delivered, and helps policymakers make data-driven decisions."
        ]
      },      
      {
        "tag": "impact_on_audience",
        "patterns": [
          "How does the system impact different audiences?",
          "Who benefits from the HDIMS application?",
          "What is the impact of HDIMS?"
        ],
        "responses": [
          "The Health Data Information & Management System impacts providers and policymakers by improving data entry, real-time updates, and decision-making."
        ]
      },
      {
        "tag": "providers_impact",
        "patterns": [
          "What is the impact on providers?",
          "How do healthcare providers benefit from HDIMS?",
          "Explain the impact on healthcare providers."
        ],
        "responses": [
          "Providers benefit from efficient data entry, real-time updates, streamlined reporting, and performance visibility. The app allows data flow from the facility level to sub-district, district, and state levels."
        ]
      },
      {
        "tag": "policymakers_impact",
        "patterns": [
          "What is the impact on policymakers?",
          "How do policymakers benefit from HDIMS?",
          "Explain the impact on policymakers."
        ],
        "responses": [
          "Policymakers benefit from health data access, trend identification, data-driven decisions, and enhanced monitoring. The system helps provide key inputs for policy formulation and program interventions."
        ]
      },
      {
        "tag": "solution_benefits",
        "patterns": [
          "What are the solution benefits?",
          "How does HDIMS benefit healthcare?",
          "Explain the advantages of HDIMS."
        ],
        "responses": [
          "HDIMS provides social, economic, and environmental benefits, including efficient healthcare, cost savings, and paper reduction."
        ]
      },
      {
        "tag": "social_benefits",
        "patterns": [
          "What are the social benefits of HDIMS?",
          "How does HDIMS impact society?",
          "Explain the social benefits."
        ],
        "responses": [
          "The social benefits include efficient healthcare, better outcomes, transparency, and equity in healthcare services, particularly through the implementation of health and family welfare schemes."
        ]
      },
      {
        "tag": "economic_benefits",
        "patterns": [
          "What are the economic benefits of HDIMS?",
          "How does HDIMS help reduce costs?",
          "Explain the economic benefits."
        ],
        "responses": [
          "The economic benefits include cost savings, reduced administrative burden, early interventions, and improved scheme efficiency, especially through dynamic data updates at various levels."
        ]
      },
      {
        "tag": "environmental_benefits",
        "patterns": [
          "What are the environmental benefits of HDIMS?",
          "How does HDIMS impact the environment?",
          "Explain the environmental benefits."
        ],
        "responses": [
          "The environmental benefits include a reduction in paper usage and transportation, contributing to a greener healthcare system."
        ]
      },
      {
        "tag": "data_entry_update",
        "patterns": [
          "How does the data entry work in HDIMS?",
          "Can hospitals update data?",
          "How is data entered in HDIMS?"
        ],
        "responses": [
          "Hospitals and departments can enter and update data in the mobile application dynamically, which can be viewed by the Super Admin for efficient implementation of health and family welfare schemes."
        ]
      },
      {
        "tag": "data_flow",
        "patterns": [
          "How does data flow work in HDIMS?",
          "How does the data travel across levels?",
          "Explain the data flow in HDIMS."
        ],
        "responses": [
          "The data flows from the facility level to sub-district, district, and state/union territory levels using the HDIMS interface, ensuring that all levels of healthcare administration have access to up-to-date information."
        ]
      }
    ]
  }
  